/************************************************************
 * 版权：2026CIMC Copyright
 * 文件：Function.c
 * 平台: 2026 CIMC GD32F470VE
************************************************************/

/************************* 头文件 *************************/
#include "Function.h"

/************************* 定义函数 *************************/

/************************************************************
 * 函数: system_init
************************************************************/
void system_init(void)
{
    systick_config();   /* SysTick */
    LED_Init();         /* LED 初始化 */
    rs485_init();       /* RS485 = USART1: PD5/PD6, DE=PE8,*/
    rs485_set_baudrate(protocol_saved_baudrate());  /*读flash波特率*/
    usart2_init();      /* debug = USART2 PD8/PD9 */
    protocol_init();    /* 协议 */

}
/****************************End*****************************/
